# 01. Работа с данными: чтение и запись
# 02. Менеджеры контекста
# 03. Выявление ошибок при работе с файлами
# 04. Режимы доступа к файлу
# 05. Параметры файлового объекта
# 06. Определение позиции указателя в файле
# 07. Print в файл
# 08. Модуль JSON
# 09. Модуль Shutil
# 10. Модуль Sys
#
# ----------------------------------------------
# Режим доступа к файлу
#
# r - открыть файл на чтение (режим по-умолчанию)
#
# w - открыть на запись. При этом удалить содержимое файла. Если файл не существует, создать новый
#
# x - открыть файл на запись, если он не существует. Если файл существует, он не будет создан
#
# a - открыть файл на дозапись. Добавить информацию в конец файла
#
# b - открыть файл в двоичном формате
#
# t - открыть файл в текстовом формате (режим по-умолчанию)
#
# + - открыть файл на чтение и запись
