"""
Алгоритм созданий функций
1. Придумать информативное имя функции
2. Подготовить строки документации:
   - назначение функции
   - типы данных параметров
   - тип данных результата
3. Придумать информативные имена параметров функции
4. Написать тело функции
"""

# ord() - (order) принимает Unicode-символ и возвращает соответствующий код (целое число)
# chr() - (char) принимает целое число и возвращает Unicode-символ, соответствующий переданному числу (коду)
# len() - принимает любой объект-последовательность (строка, набор байнтов, список, кортеж) или
#         объект-коллекцию (словарь, множество) и возвращает число элементов последовательности

# -----------------------
# abs() - принимает целое число или число с плавающей точкой. Возвращает абсолютное значение числа (по молулю)
# round() - принимает число с плавающей точкой. Округляет число до близжайшего целого числа. Также может принимать
#           число знаков после запятой, до которых необходимо выполнять округление
# divmod() - принимает два цисла, возврщает также два числа (частное и остаток от деления чисел)
# pow() - принимает два числа. Позволяет возвести первое число в указанную степень
# max() - принимает итерируемый объект и возвращает самый большой элемент
# min() - прнимает итерируемый объект и возвращает самый наименьший элемент
# sum() - суммирует элементы последовательности

# -----------------------
# range() - позволяет получить список из числе по определенным условиям
