
# Арифметические операции
# + - сложение
# - - вычитание
# * - умножение
# / - деление
# // - если число не делится на 2; полуачем только целое число
# % - получение остатка от результата
# ** - возведение в степень

# Логические операции
# > - больше
# < - меньше
# == - строго равно или просто равно (полное равенство) true/false
# != - (!) инверсия результата
# >= - больше или равен
# <= - меньше или равен
# and - логическое "И" // для совмещения
# or - логический "ИЛИ" // для выбора

# Зарезервированные слова, которые нельзя применять
# False
# True
# None
# and
# ...

