# Тип данных
# ------------
# None
# Числа
# Исключения
# Строки
# - Конкатенация
# - Взятие элемента по индексу
# - Извлечение среза
# - Обратная итерация
# - Реверс на месте
# Байты
# Множества // специальный тип списочных данных, хранит только уникальные значения и использует меньше памяти чем списки
# - Стандартные множества
# -- set()
# - Неизменные множества
# -- frozenset()
# Кортежи // определяются при старте программы, далее не изменяются (используют меньше памяти чем списки)
# - tuple (кортёж)

# Списки
# - list (список)

# Словари
# ------------
# Пример типа None
login = None
if login == None:
    print("403")
# ------------
